app/controllers/members_controller.rb

  def index
    @members = Member.all
---
SELECT `members`.* FROM `members`

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO `members` (`enum`, `password_digest`, `name`, `birth`, `position`, `department`, `created_at`, `updated_at`, `remember_token`) VALUES ('1', '$2a$10$b0dmVXHCRboVG05QDHDWi.9hDfhv4spzJwhHgLbVBi4eMnAiMd.RK', '1', '1', '', '', '2015-09-20 13:14:44', '2015-09-20 13:14:44', '12edd94bbfbccd915615306966075b915dfbf8a8')

  def update
    respond_to do |format|
      if @member.update(member_params)
---
UPDATE `members` SET `password_digest` = '$2a$10$BgMP09DXGGLt0RFkmD2TmetCIac8JW1WJ8RzgUYgnUiMVXxTAzDka', `image_path` = 'despicable-me-2-Minion-icon-7.png', `updated_at` = '2015-09-22 19:39:30' WHERE `members`.`enum` = '3'