app/controllers/session_controller.rb

SELECT  `members`.* FROM `members` WHERE `members`.`enum` = '1' LIMIT 1
---
	def create
  		member = Member.find_by(enum: params[:session][:enum])